2.2 데이터 프레임(DataFrame)

In [4]:
import numpy as np
import pandas as pd

- 생성 방법1
    - 2차원 데이터, 컬럼, 인덱스

In [5]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),       # 2차원 데이터
    columns=list('XYZ'),            # 컬럼명, list('XYZ') ==> ['X','Y','Z']
    index=list('abcd')              # 인덱스
)
df1

    X   Y   Z
a  47  96  69
b  86  88  81
c  50  86  68
d  53  41  77

- 생성방법2
    - 딕셔너리의 리스트

In [6]:
data = [ 
    {'x':67, 'Y':50, 'Z':45},
    {'x':72, 'Y':88, 'Z':79},
    {'x':71, 'Y':78, 'Z':57},
    {'x':82, 'Y':75, 'Z':98},
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

    x   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 생성방법 3
    - 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [7]:
data = {
    'X': [67, 72, 71, 82],
    'Y': [50, 88, 78, 75],
    'Z': [45, 79, 57, 98]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X   Y   Z
a  67  50  45
b  72  88  79
c  71  78  57
d  82  75  98

- 여러가지 타입이 혼합된 형태의 데이터로 생성

In [8]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [9]:
df.index.name = '도시'          # 컬럼 이름은 반드시 들어가야 하지만 인덱스의 이름은 있어도 그만, 없어도 그만.
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [10]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [11]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='항목')

In [12]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

- 연습문제 4.1.2

In [13]:
data = {
    "치토스": [4, 5, 2, 1, 8],
    "스윙칩": [5.512, 0.222, 2.201, 1.563, 2.459],
    "통크": ['품절', '품절', '품절', '품절','품절'],
    "포카칩": [3, 5, 8, 12, 10],
    "빈츠": [5, 4, 2, 0, 23],
    "별명": ["탱크보이", "고구마", "밍꼬", "물개","용사여"],
    "얼마나먹음": [0.0283, 0.0163, 0.0982, 0.0141, 0.123]
}
columns = ["별명", "치토스", "스윙칩", "통크", "포카칩","빈츠", "얼마나먹음"]
index = ["조세훈", "남지영", "주세희", "신영화", "용사님"]
df = pd.DataFrame(data, index=index, columns=columns)
df

       별명  치토스    스윙칩  통크  포카칩  빈츠   얼마나먹음
조세훈  탱크보이    4  5.512  품절    3   5  0.0283
남지영   고구마    5  0.222  품절    5   4  0.0163
주세희    밍꼬    2  2.201  품절    8   2  0.0982
신영화    물개    1  1.563  품절   12   0  0.0141
용사님   용사여    8  2.459  품절   10  23  0.1230

In [14]:
# 다른 풀이 
data = []
for i in range(5):
    d = {
        '문자열': chr(np.random.randint(65.91)) +  chr(np.random.randint(65.91)),
        '정수1': np.random.randint(1, 7),
        '정수2': np.random.randint(40, 101),
        '정수3': np.random.randint(1, 100) * 1000,
        '실수': round(np.random.random(), 4)
    }
    data.append(d)
df4 = pd.DataFrame(data, index=list('vwxyz'))
df4

  문자열  정수1  정수2    정수3      실수
v  5    6   59  62000  0.6587
w  0    5   77  15000  0.3842
x       5   53  99000  0.2760
y  @9    2   96  41000  0.7097
z  =    4   61  44000  0.5652

- 전치(Transpose)

In [15]:
df4.T

          v       w      x       y       z
문자열      5      0            @9      =
정수1       6       5      5       2       4
정수2      59      77     53      96      61
정수3   62000   15000  99000   41000   44000
실수   0.6587  0.3842  0.276  0.7097  0.5652

- 열 데이터의 갱신, 추가

In [16]:
df

       별명  치토스    스윙칩  통크  포카칩  빈츠   얼마나먹음
조세훈  탱크보이    4  5.512  품절    3   5  0.0283
남지영   고구마    5  0.222  품절    5   4  0.0163
주세희    밍꼬    2  2.201  품절    8   2  0.0982
신영화    물개    1  1.563  품절   12   0  0.0141
용사님   용사여    8  2.459  품절   10  23  0.1230

In [17]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [18]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [19]:
# 열 이름이 있으면 갱신, 없으면 추가
df['Eng name'] = ['Seoul','Busan','Incheon','Daegu']
df

     지역     2015     2010     2005     2000  2010-2015 증가율 Eng name
서울  수도권  9904312  9631482  9762546  9853972           2.83    Seoul
부산  경상권  3448737  3393191  3512547  3655437           1.63    Busan
인천  수도권  2890451  2632035  2517680  2466338           9.82  Incheon
대구  경상권  2466052  2431774  2456016  2473990           1.41    Daegu

- 열 삭제

In [20]:
del df['2000']

In [21]:
df.drop(columns=['2005','2010'], inplace=True)
df

     지역     2015  2010-2015 증가율 Eng name
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon
대구  경상권  2466052           1.41    Daegu

In [22]:
# 행을 지울 때 
df.drop(['대구'], inplace=True)
df

     지역     2015  2010-2015 증가율 Eng name
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon

- 열 인덱싱

In [23]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역']

서울    수도권
부산    경상권
인천    수도권
Name: 지역, dtype: object

In [24]:
# 열 이름이 리스트로 감싸져 있으면 데이터프레임 반환
df[['지역','Eng name']]

     지역 Eng name
서울  수도권    Seoul
부산  경상권    Busan
인천  수도권  Incheon

- 개별 인덱싱

In [25]:
# 데이터프레임[열 이름][행 인덱스] , 데이터 프레임 만틈은 행보다 열이 먼저!
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [26]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없음
df.2015['서울'] , df[2015]['서울']

SyntaxError: invalid syntax (3742094998.py, line 2)

- 연습문제 4.1.3

![Alt text](image.png)

In [27]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [28]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
s = pd.Series([90, 60, 80, 70],
              index=["춘향", "몽룡", "향단", "방자"])
s

춘향    90
몽룡    60
향단    80
방자    70
dtype: int64

In [29]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [30]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40]
}
columns = ["국어", "영어"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [31]:
df[['국어', '영어']]        # 값이 들어오면 시리즈, 리스트가 들어오면 데이터 프레임이 된다.
df

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [32]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [33]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df.mean(axis='columns')
df["평균점수"] = round(df.mean(axis='columns'),2)

In [34]:
df

    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [44]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [45]:
# 또 다른 방법
df['평균'] = (df.sum(axis=1) / len(df.columns)).round(1)        # round()소수점 몇째자리까지.
# (df.국어 + df. 영어 + df.수학) / 3
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [67]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [65]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.loc['방자', '영어'] = 80
df.mean(axis='columns')
df["평균점수"] = round(df.mean(axis='columns'),2)
df

    국어  영어  수학   평균점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [68]:
# 또 다른 방법 
import warnings
warnings.filterwarnings('ignore')

del df['평균']
df['영어']['방자'] = 80
df['평균'] = (df.sum(axis=1) / len(df.columns)).round(1)
df

KeyError: '평균'

In [ ]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[['춘향']]

    국어  영어  수학   평균점수
춘향  80  90  90  86.67

In [53]:
df[0:1]

    국어  영어  수학   평균점수
춘향  80  90  90  86.67

In [54]:
df['춘향':'춘향']

    국어  영어  수학   평균점수
춘향  80  90  90  86.67

In [ ]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

In [55]:
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64